ss1969/EdgeTx-AT32F435EVB/project/src/main.c
/* add user code begin Header */
/**
  **************************************************************************
  * @file     main.c
  * @brief    main program
  **************************************************************************
  * Copyright (c) 2025, Artery Technology, All rights reserved.
  *
  * The software Board Support Package (BSP) that is made available to
  * download from Artery official website is the copyrighted work of Artery.
  * Artery authorizes customers to use, copy, and distribute the BSP
  * software and its related documentation for the purpose of design and
  * development in conjunction with Artery microcontrollers. Use of the
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */
/* add user code end Header */

/* Includes ------------------------------------------------------------------*/
#include "at32f435_437_wk_config.h"
#include "wk_acc.h"
#include "wk_exint.h"
#include "wk_qspi.h"
#include "wk_spi.h"
#include "wk_usart.h"
#include "wk_usb_otgfs.h"
#include "wk_dma.h"
#include "wk_edma.h"
#include "wk_gpio.h"
#include "wk_system.h"

/* private includes ----------------------------------------------------------*/
/* add user code begin private includes */
#include "aps6404l.h"
#include "txw430038b0_nv3041a_01_spi.h"
#if TXW430038B0_LCD_BUS_MODE == TXW430038B0_LCD_BUS_MODE_QSPI2
#include "qspi2_lcd_bus.h"
#else
#include "spi_lcd_bus.h"
#endif
#include "cat_rgb565.h"
#include "uart3_printf.h"
#include <stdlib.h>
/* add user code end private includes */

/* private typedef -----------------------------------------------------------*/
/* add user code begin private typedef */

/* add user code end private typedef */

/* private define ------------------------------------------------------------*/
/* add user code begin private define */
#define APS6404L_TEST_TOTAL_BYTES         (1U * 1024U * 1024U)
#define APS6404L_TEST_CHUNK_SIZE          (8U * 1024U)
#define APS6404L_TEST_PROGRESS_STEP       (256U * 1024U)

#define APS6404L_BENCH_TOTAL_BYTES        (256U * 1024U)
#define APS6404L_BENCH_CHUNK_BYTES        (64U * 1024U)

/* add user code end private define */

/* private macro -------------------------------------------------------------*/
/* add user code begin private macro */

/* add user code end private macro */

/* private variables ---------------------------------------------------------*/
/* add user code begin private variables */

/* add user code end private variables */

/* private function prototypes --------------------------------------------*/
/* add user code begin function prototypes */
static int lcd_fill_color(uint16_t color);

/* add user code end function prototypes */

/* private user code ---------------------------------------------------------*/
/* add user code begin 0 */
static void aps_perf_init(void)
{
  CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
  DWT->CYCCNT = 0;
  DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}

static uint32_t aps_perf_cycles(void)
{
  return DWT->CYCCNT;
}

static void aps_print_speed(const char *tag, uint32_t bytes, uint32_t cycles)
{
  uint64_t bps64;
  uint32_t mib_x10;

  if(cycles == 0U)
  {
    UART3_Printf("%s: cycles=0\r\n", tag);
    return;
  }

  bps64 = ((uint64_t)bytes * (uint64_t)SystemCoreClock) / (uint64_t)cycles;
  mib_x10 = (uint32_t)((bps64 * 10ULL) / (1024ULL * 1024ULL));

  UART3_Printf("%s: bytes=%lu cycles=%lu speed=%lu.%lu MiB/s\r\n",
               tag,
               (unsigned long)bytes,
               (unsigned long)cycles,
               (unsigned long)(mib_x10 / 10U),
               (unsigned long)(mib_x10 % 10U));
}

static uint8_t uart3_getc_blocking(void)
{
  while(usart_flag_get(USART3, USART_RDBF_FLAG) == RESET)
  {
  }

  return (uint8_t)usart_data_receive(USART3);
}

static int hex_char_to_nibble(uint8_t ch, uint8_t *nibble)
{
  if(nibble == 0)
  {
    return 0;
  }

  if((ch >= '0') && (ch <= '9'))
  {
    *nibble = (uint8_t)(ch - '0');
    return 1;
  }
  if((ch >= 'A') && (ch <= 'F'))
  {
    *nibble = (uint8_t)(ch - 'A' + 10U);
    return 1;
  }
  if((ch >= 'a') && (ch <= 'f'))
  {
    *nibble = (uint8_t)(ch - 'a' + 10U);
    return 1;
  }

  return 0;
}

static uint16_t uart3_read_hex_u16_blocking(void)
{
  uint16_t value = 0U;
  uint32_t digits = 0U;
  uint8_t nibble;
  uint8_t ch;

  for(;;)
  {
    ch = uart3_getc_blocking();
    if((ch == '\r') || (ch == '\n') || (ch == ' ') || (ch == '\t'))
    {
      continue;
    }
    if(hex_char_to_nibble(ch, &nibble))
    {
      UART3_Printf("%c", ch);
      value = (uint16_t)((value << 4) | nibble);
      digits++;
      if(digits >= 4U)
      {
        break;
      }
    }
  }

  UART3_Printf("\r\n");
  return value;
}

static void lcd_uart_fill_loop(void)
{
  UART3_Printf("LCD: input 4 hex chars (0000-FFFF), fill screen with this value\r\n");

  for(;;)
  {
    uint16_t color = uart3_read_hex_u16_blocking();

    UART3_Printf("LCD: fill color=");
    UART3_PrintHexByte((uint8_t)(color >> 8));
    UART3_PrintHexByte((uint8_t)color);
    UART3_Printf("\r\n");

    if(!lcd_fill_color(color))
    {
      UART3_Printf("LCD: fill FAIL\r\n");
    }
  }
}

static int lcd_fill_color(uint16_t color)
{
  static uint16_t line[TXW430038B0_WIDTH];
  uint32_t y;
  uint32_t i;

  for(i = 0; i < TXW430038B0_WIDTH; i++)
  {
    line[i] = color;
  }

