ss1969/EdgeTx-AT32F435EVB/project/src/main.c
  for(y = 0; y < TXW430038B0_HEIGHT; y++)
  {
    if(!txw430038b0_nv3041a_01_set_window(0U,
                                          (uint16_t)y,
                                          (uint16_t)(TXW430038B0_WIDTH - 1U),
                                          (uint16_t)y))
    {
      return 0;
    }
    if(!txw430038b0_nv3041a_01_write_pixels_rgb565(line, TXW430038B0_WIDTH))
    {
      return 0;
    }
  }

  return 1;
}

static int lcd_draw_test_bars(void)
{
  static const uint16_t test_colors[] = {
    0xF800U, /* red */
    0x07E0U, /* green */
    0x001FU, /* blue */
    0xFFFFU, /* white */
    0x0000U  /* black */
  };
  static uint16_t line[TXW430038B0_WIDTH];
  uint32_t y;
  uint32_t x;

  for(y = 0; y < TXW430038B0_HEIGHT; y++)
  {
    for(x = 0; x < TXW430038B0_WIDTH; x++)
    {
      uint32_t bar = (x * (uint32_t)(sizeof(test_colors) / sizeof(test_colors[0]))) / TXW430038B0_WIDTH;

      if(bar >= (uint32_t)(sizeof(test_colors) / sizeof(test_colors[0])))
      {
        bar = (uint32_t)(sizeof(test_colors) / sizeof(test_colors[0])) - 1U;
      }

      line[x] = test_colors[bar];
    }

    if(!txw430038b0_nv3041a_01_set_window(0U,
                                          (uint16_t)y,
                                          (uint16_t)(TXW430038B0_WIDTH - 1U),
                                          (uint16_t)y))
    {
      return 0;
    }
    if(!txw430038b0_nv3041a_01_write_pixels_rgb565(line, TXW430038B0_WIDTH))
    {
      return 0;
    }
  }

  return 1;
}

static void lcd_run_bmp_test(void)
{
  BitmapBuffer bmp;
  uint32_t t0;
  uint32_t t1;
  uint32_t draw_ms;

  bmp.width = BMP_WIDTH;
  bmp.height = BMP_HEIGHT;
  bmp.format = BMP_FORMAT_RGB565;
  bmp.data = (uint8_t *)(void *)bmp_pixels;

  aps_perf_init();
  t0 = aps_perf_cycles();
  txw430038b0_nv3041a_01_spi_drawBitmap(&bmp, 0, 0);
  t1 = aps_perf_cycles();

  draw_ms = (uint32_t)(((uint64_t)(t1 - t0) * 1000ULL) / (uint64_t)SystemCoreClock);
  UART3_Printf("LCD: bmp draw_ms=%lu\r\n", (unsigned long)draw_ms);
}


/* add user code end 0 */

/**
  * @brief main function.
  * @param  none
  * @retval none
  */
int main(void)
{
  /* add user code begin 1 */

  /* add user code end 1 */

  /* system clock config. */
  wk_system_clock_config();

  /* config periph clock. */
  wk_periph_clock_config();

  /* nvic config. */
  wk_nvic_config();

  /* timebase config for
     void wk_delay_us(uint32_t delay);
     void wk_delay_ms(uint32_t delay); */
  wk_timebase_init();

  /* init gpio function. */
  wk_gpio_config();

  /* init dma1 channel1 */
  wk_dma1_channel1_init();
  /* config dma channel transfer parameter */
  /* user need to modify define values DMAx_CHANNELy_XXX_BASE_ADDR
     and DMAx_CHANNELy_BUFFER_SIZE in at32xxx_wk_config.h */
  wk_dma_channel_config(DMA1_CHANNEL1,
                        (uint32_t)&SPI1->dt,
                        DMA1_CHANNEL1_MEMORY_BASE_ADDR,
                        DMA1_CHANNEL1_BUFFER_SIZE);
  dma_channel_enable(DMA1_CHANNEL1, FALSE);

  /* init edma stream1 */
  wk_edma_stream1_init();
  /* config edma stream transfer parameter */
  /* user need to modify define values EDMA_STREAMx_XXX_BASE_ADDR
     and EDMA_STREAMx_BUFFER_SIZE in at32xxx_wk_config.h */
  wk_edma_stream_config(EDMA_STREAM1,
                        (uint32_t)&QSPI1->dt,
                        EDMA_STREAM1_MEMORY0_BASE_ADDR,
                        EDMA_STREAM1_BUFFER_SIZE);
  /* enable stream */
  edma_stream_enable(EDMA_STREAM1, TRUE);

  /* init usart1 function. */
  wk_usart1_init();

  /* init usart2 function. */
  wk_usart2_init();

  /* init usart3 function. */
  wk_usart3_init();

  /* init acc function. */
  wk_acc_init();

  /* init usb_otgfs1 function. */
  wk_usb_otgfs1_init();

  /* init spi1 function. */
  wk_spi1_init();

  /* init qspi1 function. */
  wk_qspi1_init();

  /* init qspi2 function. */
  wk_qspi2_init();

  /* init exint function. */
  wk_exint_config();

  /* add user code begin 2 */
  unsigned char id[8];
  int i;

  UART3_Printf("\x1b[2J\x1b[H");
  UART3_Printf("start up\r\n");

  /* add user code end 2 */

  while(1)
  {
    /* add user code begin 3 */
    static unsigned char ran = 0;

    if(!ran)
    {
#if 0
      int ok;
      unsigned char *write_buf;
      volatile unsigned char *psram = (volatile unsigned char *)APS6404L_MEM_BASE;
      unsigned int addr;
      unsigned int fail_addr = 0;
      unsigned int offset;
      unsigned char pass = 1;
      unsigned char fail_index = 0;
      unsigned char fail_exp = 0;
      unsigned char fail_got = 0;
      unsigned int seed;
      unsigned int chunk_len;
      unsigned char used_malloc = 0;
      static unsigned char write_buf_fallback[APS6404L_TEST_CHUNK_SIZE];

      for(i = 0; i < (int)sizeof(id); i++)
      {
        id[i] = 0;
      }

      PSRAM_Reset();
      ok = PSRAM_ReadID(id, (int)sizeof(id));

      UART3_Printf("APS RDID:");
      for(i = 0; i < (int)sizeof(id); i++)
      {
        UART3_PrintHexByte(id[i]);
      }
      UART3_Printf("\r\n");

      if(ok)
      {
        unsigned char all_ff = 1;
        for(i = 0; i < (int)sizeof(id); i++)
        {
          if(id[i] != 0xFF)
          {
            all_ff = 0;
            break;
          }
        }
        if(all_ff)
        {
          ok = 0;
        }
      }

      if(!ok)
      {
        UART3_Printf("APS RDID: FAIL\r\n");
      }

      {
        unsigned char qpi_w[32];
        unsigned char qpi_r[32];
        unsigned char qpi_pass = 1;
        unsigned char qpi_fail_index = 0;

        for(i = 0; i < (int)sizeof(qpi_w); i++)
        {
          qpi_w[i] = (unsigned char)(0xA0 + i);
          qpi_r[i] = 0;
        }

        UART3_Printf("APS QPI FAST: START\r\n");
        if(!PSRAM_EnterQuadMode())
        {
          UART3_Printf("APS QPI FAST: ENTER FAIL\r\n");
        }
        else
        {
          if(!PSRAM_QPI_FastWrite(0, qpi_w, (int)sizeof(qpi_w)))
          {
            UART3_Printf("APS QPI FAST: W FAIL\r\n");
          }
          else if(!PSRAM_QPI_FastRead(0, qpi_r, (int)sizeof(qpi_r)))
          {
            UART3_Printf("APS QPI FAST: R FAIL\r\n");
          }
          else
          {
            for(i = 0; i < (int)sizeof(qpi_w); i++)
            {
              if(qpi_w[i] != qpi_r[i])
              {
                qpi_pass = 0;
                qpi_fail_index = (unsigned char)i;
                break;
              }
            }

            if(qpi_pass)
            {
              UART3_Printf("APS QPI FAST: OK\r\n");
            }
            else
            {
              UART3_Printf("APS QPI FAST: FAIL idx=");
              UART3_PrintHexByte(qpi_fail_index);
              UART3_Printf(" exp=");
              UART3_PrintHexByte(qpi_w[qpi_fail_index]);
              UART3_Printf(" got=");
              UART3_PrintHexByte(qpi_r[qpi_fail_index]);
              UART3_Printf("\r\n");
            }
          }

