ss1969/EdgeTx-AT32F435EVB/project/src/main.c
          if(!PSRAM_ExitQuadMode())
          {
            UART3_Printf("APS QPI FAST: EXIT FAIL\r\n");
          }
        }
      }

      PSRAM_Reset();

      {
        static uint32_t bench_w_u32[APS6404L_BENCH_CHUNK_BYTES / 4U];
        static uint32_t bench_r_u32[APS6404L_BENCH_CHUNK_BYTES / 4U];
        unsigned char *bench_w = (unsigned char *)bench_w_u32;
        unsigned char *bench_r = (unsigned char *)bench_r_u32;
        uint32_t t0;
        uint32_t t1;
        uint32_t off;
        uint32_t sum;
        uint32_t base = 0x00100000u;
        int bench_ok = 1;

        aps_perf_init();

        for(i = 0; i < (int)APS6404L_BENCH_CHUNK_BYTES; i++)
        {
          bench_w[i] = (unsigned char)(0xC3u ^ (unsigned char)i);
          bench_r[i] = 0;
        }

        UART3_Printf("APS BENCH: total=");
        UART3_PrintHexU32(APS6404L_BENCH_TOTAL_BYTES);
        UART3_Printf(" chunk=");
        UART3_PrintHexU32(APS6404L_BENCH_CHUNK_BYTES);
        UART3_Printf("\r\n");

        t0 = aps_perf_cycles();
        for(off = 0; off < APS6404L_BENCH_TOTAL_BYTES; off += APS6404L_BENCH_CHUNK_BYTES)
        {
          if(!PSRAM_QPI_Write(base + off, bench_w, (int)APS6404L_BENCH_CHUNK_BYTES))
          {
            bench_ok = 0;
            break;
          }
        }
        t1 = aps_perf_cycles();
        if(bench_ok)
        {
          aps_print_speed("APS BENCH WR 111", APS6404L_BENCH_TOTAL_BYTES, t1 - t0);
        }
        else
        {
          UART3_Printf("APS BENCH WR 111: FAIL\r\n");
        }

        sum = 0;
        bench_ok = 1;
        t0 = aps_perf_cycles();
        for(off = 0; off < APS6404L_BENCH_TOTAL_BYTES; off += APS6404L_BENCH_CHUNK_BYTES)
        {
          if(!PSRAM_QPI_Read(base + off, bench_r, (int)APS6404L_BENCH_CHUNK_BYTES))
          {
            bench_ok = 0;
            break;
          }
          for(i = 0; i < 16; i++)
          {
            sum ^= (uint32_t)bench_r[i];
          }
        }
        t1 = aps_perf_cycles();
        if(bench_ok)
        {
          aps_print_speed("APS BENCH RD 111", APS6404L_BENCH_TOTAL_BYTES, t1 - t0);
          UART3_Printf("APS BENCH RD 111: sum=");
          UART3_PrintHexU32(sum);
          UART3_Printf("\r\n");
        }
        else
        {
          UART3_Printf("APS BENCH RD 111: FAIL\r\n");
        }

        if(PSRAM_EnterQuadMode())
        {
          bench_ok = 1;
          t0 = aps_perf_cycles();
          for(off = 0; off < APS6404L_BENCH_TOTAL_BYTES; off += APS6404L_BENCH_CHUNK_BYTES)
          {
            if(!PSRAM_QPI_FastWrite(base + off, bench_w, (int)APS6404L_BENCH_CHUNK_BYTES))
            {
              bench_ok = 0;
              break;
            }
          }
          t1 = aps_perf_cycles();
          if(bench_ok)
          {
            aps_print_speed("APS BENCH WR 444", APS6404L_BENCH_TOTAL_BYTES, t1 - t0);
          }
          else
          {
          UART3_Printf("APS BENCH WR 444: FAIL\r\n");
          }

          sum = 0;
          bench_ok = 1;
          t0 = aps_perf_cycles();
          for(off = 0; off < APS6404L_BENCH_TOTAL_BYTES; off += APS6404L_BENCH_CHUNK_BYTES)
          {
            if(!PSRAM_QPI_FastRead(base + off, bench_r, (int)APS6404L_BENCH_CHUNK_BYTES))
            {
              bench_ok = 0;
              break;
            }
            for(i = 0; i < 16; i++)
            {
              sum ^= (uint32_t)bench_r[i];
            }
          }
          t1 = aps_perf_cycles();
          if(bench_ok)
          {
            aps_print_speed("APS BENCH RD 444", APS6404L_BENCH_TOTAL_BYTES, t1 - t0);
            UART3_Printf("APS BENCH RD 444: sum=");
            UART3_PrintHexU32(sum);
            UART3_Printf("\r\n");
          }
          else
          {
          UART3_Printf("APS BENCH RD 444: FAIL\r\n");
          }

          if(!PSRAM_ExitQuadMode())
          {
            UART3_Printf("APS BENCH: EXIT QPI FAIL\r\n");
          }
        }
        else
        {
          UART3_Printf("APS BENCH: ENTER QPI FAIL\r\n");
        }

        bench_ok = 1;
        t0 = aps_perf_cycles();
        for(off = 0; off < APS6404L_BENCH_TOTAL_BYTES; off += APS6404L_BENCH_CHUNK_BYTES)
        {
          if(!PSRAM_EDMA_Write(base + off, bench_w, (int)APS6404L_BENCH_CHUNK_BYTES))
          {
            bench_ok = 0;
            break;
          }
        }
        t1 = aps_perf_cycles();
        if(bench_ok)
        {
          aps_print_speed("APS BENCH WR EDMA", APS6404L_BENCH_TOTAL_BYTES, t1 - t0);
        }
        else
        {
          UART3_Printf("APS BENCH WR EDMA: FAIL\r\n");
        }

        sum = 0;
        bench_ok = 1;
        t0 = aps_perf_cycles();
        for(off = 0; off < APS6404L_BENCH_TOTAL_BYTES; off += APS6404L_BENCH_CHUNK_BYTES)
        {
          if(!PSRAM_EDMA_Read(base + off, bench_r, (int)APS6404L_BENCH_CHUNK_BYTES))
          {
            bench_ok = 0;
            break;
          }
          for(i = 0; i < 16; i++)
          {
            sum ^= (uint32_t)bench_r[i];
          }
        }
        t1 = aps_perf_cycles();
        if(bench_ok)
        {
          aps_print_speed("APS BENCH RD EDMA", APS6404L_BENCH_TOTAL_BYTES, t1 - t0);
          UART3_Printf("APS BENCH RD EDMA: sum=");
          UART3_PrintHexU32(sum);
          UART3_Printf("\r\n");
        }
        else
        {
          UART3_Printf("APS BENCH RD EDMA: FAIL\r\n");
        }
      }

      {
        static uint32_t edma_w_u32[256];
        static uint32_t edma_r_u32[256];
        unsigned char edma_pass = 1;
        unsigned char edma_fail_index = 0;
        unsigned int edma_len = (unsigned int)sizeof(edma_w_u32);
        unsigned char *edma_w = (unsigned char *)edma_w_u32;
        unsigned char *edma_r = (unsigned char *)edma_r_u32;

        for(i = 0; i < (int)edma_len; i++)
        {
          edma_w[i] = (unsigned char)(0x55u ^ (unsigned char)i);
          edma_r[i] = 0;
        }

        UART3_Printf("APS EDMA RW: START len=");
        UART3_PrintHexU32(edma_len);
        UART3_Printf("\r\n");

