ss1969/EdgeTx-AT32F435EVB/project/src/main.c
        if(!PSRAM_EDMA_Write(0x00001000u, edma_w, (int)edma_len))
        {
          UART3_Printf("APS EDMA RW: W FAIL\r\n");
        }
        else if(!PSRAM_EDMA_Read(0x00001000u, edma_r, (int)edma_len))
        {
          UART3_Printf("APS EDMA RW: R FAIL\r\n");
        }
        else
        {
          for(i = 0; i < (int)edma_len; i++)
          {
            if(edma_w[i] != edma_r[i])
            {
              edma_pass = 0;
              edma_fail_index = (unsigned char)i;
              break;
            }
          }

          if(edma_pass)
          {
            UART3_Printf("APS EDMA RW: OK\r\n");
          }
          else
          {
            UART3_Printf("APS EDMA RW: FAIL idx=");
            UART3_PrintHexByte(edma_fail_index);
            UART3_Printf(" exp=");
            UART3_PrintHexByte(edma_w[edma_fail_index]);
            UART3_Printf(" got=");
            UART3_PrintHexByte(edma_r[edma_fail_index]);
            UART3_Printf("\r\n");
          }
        }
      }

      UART3_Printf("APS RW 1MB: START\r\n");

      write_buf = (unsigned char *)malloc(APS6404L_TEST_CHUNK_SIZE);
      if(write_buf == 0)
      {
        write_buf = write_buf_fallback;
        UART3_Printf("APS RW 1MB: MALLOC FAIL, USE STATIC\r\n");
      }
      else
      {
        used_malloc = 1;
      }

      addr = 0;
      for(offset = 0; offset < APS6404L_TEST_TOTAL_BYTES; offset += APS6404L_TEST_CHUNK_SIZE)
      {
        if((offset % APS6404L_TEST_PROGRESS_STEP) == 0U)
        {
          UART3_Printf("off=");
          UART3_PrintHexU32(offset);
          UART3_Printf("\r\n");
        }

        chunk_len = APS6404L_TEST_CHUNK_SIZE;
        if((APS6404L_TEST_TOTAL_BYTES - offset) < chunk_len)
        {
          chunk_len = APS6404L_TEST_TOTAL_BYTES - offset;
        }

        seed = 0x6D2B79F5u ^ (addr + offset);
        for(i = 0; i < (int)chunk_len; i++)
        {
          seed ^= seed << 13;
          seed ^= seed >> 17;
          seed ^= seed << 5;
          write_buf[i] = (unsigned char)(seed & 0xFFu);
        }

        for(i = 0; i < (int)chunk_len; i++)
        {
          psram[addr + offset + (unsigned int)i] = write_buf[i];
        }

        __DSB();
        __ISB();

        for(i = 0; i < (int)chunk_len; i++)
        {
          unsigned char got = psram[addr + offset + (unsigned int)i];
          if(write_buf[i] != got)
          {
            pass = 0;
            fail_addr = addr + offset;
            fail_index = (unsigned char)i;
            fail_exp = write_buf[i];
            fail_got = got;
            break;
          }
        }

        if(!pass)
        {
          break;
        }
      }

      if(used_malloc)
      {
        free(write_buf);
      }

      if(pass)
      {
        UART3_Printf("APS RW 1MB: OK\r\n");
      }
      else
      {
        UART3_Printf("APS RW 1MB: FAIL addr=");
        UART3_PrintHexU32(fail_addr);
        UART3_Printf(" idx=");
        UART3_PrintHexByte(fail_index);
        UART3_Printf(" exp=");
        UART3_PrintHexByte(fail_exp);
        UART3_Printf(" got=");
        UART3_PrintHexByte(fail_got);
        UART3_Printf("\r\n");
        for(i = 0; i < 16; i++)
        {
          UART3_PrintHexByte(psram[fail_addr + (unsigned int)i]);
        }
        UART3_Printf("\r\n");
      }

      ran = 1;
#endif

      {
        if(!txw430038b0_nv3041a_01_init())
        {
          UART3_Printf("LCD: init FAIL\r\n");
#if TXW430038B0_LCD_BUS_MODE == TXW430038B0_LCD_BUS_MODE_QSPI2
          UART3_Printf("LCD: qspi2 bus fail\r\n");
#endif
        }
        else
        {
          UART3_Printf("LCD: %s init OK\r\n", txw430038b0_nv3041a_01_name());
          UART3_Printf("LCD: cfg bus=QSPI2 cmd=111 pixel=114 gram=RAM32 dctl=01 rgb=565\r\n");

#if TXW430038B0_LCD_BUS_MODE == TXW430038B0_LCD_BUS_MODE_QSPI2
          wk_delay_ms(30);
          (void)qspi2_lcd_bus_wait_te_fall(2000000U);
          (void)qspi2_lcd_bus_wait_te_rise(2000000U);
#endif

          if(!lcd_draw_test_bars())
          {
            UART3_Printf("LCD: draw 5 bars FAIL\r\n");
          }
          else
          {
            UART3_Printf("LCD: bars RED GREEN BLUE WHITE BLACK shown\r\n");
          }

          lcd_run_bmp_test();
          lcd_uart_fill_loop();
        }
      }

      ran = 1;
    }

    wk_delay_ms(1000);

    /* add user code end 3 */
  }
}

  /* add user code begin 4 */

  /* add user code end 4 */
